{
    "K7": "This criteria focuses on the Roles, functions and activities within Digital Technology solutions within an organisation. I like that you had the opportunity to speak to service owners regarding an opportunity and complete a security assessment. To develop your submission further, you should make sure to include some screenshots or snippets so showcase the work carried out. I would also like to see a discussion of why this task was completed and its benefit to the business. You should also outline what you were looking for when you reviewed software and also note some of the security improvements suggested and how these would enable to software to perform better.",
    "S9": "This criteria should involve applying relevant security and resilience technique to a digital and\ntechnology solutions. I believe that you've provided a good example of this in action. To develop\nyour solution further, I would outline key features of the NIST framework. You should also discuss\nwhat a maturity assessment is and what it aims to achieve. I would recommend including some\nsnippets to showcase the risk registers that you created. This will allow you discuss the key\nconsiderations you had to make when completing the risk register and also discuss how you\nadhered to the company guidelines when filling out these documents.",
    "B1": "It is great to hear that you were supporting your colleague by picking up some of their tasks. You\nshould discuss how you managed the extra work load and how you kept stakeholders up to date\nwith progress. I would recommend discussing what tools and techniques were used to help with\nthis.",
    "K6": "It is great to see that you transferred the codebase into an Object oriented form. To develop your\ndiscussion further, you should outline what key considerations you had to make in order to transfer\nthe code to an Object Oriented form. This discussion should also include how you made sure to\nreuse code and how you followed good coding practises.",
    "B2": "It is great to see that you've found an opportunity to work independently. I like that you were able to\nconduct the maturity assessment independently. To develop your discussion further, you should\noutline the actions you took to ensure that you were able to work and complete the forms\nindependently. Did you spend some time shadowing a colleague or reviewing previous examples?\nOnce these updates have been made, I will mark this activity as completed.\nKeep up the hard work!",
    "B6": "It is great to see that you were able to follow the steps and get access to set up your environment\ncorrectly. To develop your submission further, you should outline how the steps you followed are\nconsidered best practise. You should include screenshots to showcase how you followed the\nguidance and also outline what issues can arise for not following the best practices.",
    "S12": "I like that you were able to work on tickets that managed the infrastructure of an application. It is\ngreat to hear that you were asked to set up route tables and DNS zones to allow the subnets to\ncommunicate. To develop your discussion further, you should outline the reason why this job\nneeded to be completed. This will further showcase the business case for the project. It would be\nbeneficial to define what a route table is and also what is meant by DNS Zones. This will help to\nshowcase your understanding of computer networking components.",
    "K23": "I noticed that your submission was deleted. Here was the feedback that was provided previously:\nTo develop this submission, you should make sure you outline what scrum means and the different\npractices and guidelines that are involved. You should include screenshots to showcase the work\nyou carried out and discuss how you actioned your tasks.\nPlease update your submission as suggested.",
    "S10": "Please note that this is a skills criteria and as a result, you should be demonstrating how you are\napplying the skill. You should make sure to include screenshots to showcase this.\nIn the situation section, you should outline what issues are currently being faced. This will help to\nemphasise the business need for the project.\nThe task section should outline what tasks you need to complete. This should be a discussion of\nyour plan which outlines how the issues will be fixed.\nYour action section should be used to showcase the actions you took. You should make sure to\ndiscuss the specific technologies that were used to develop, design and debug your project. It\nwould be good to include screenshots to showcase the actions.",
    "K24": "In your task section, you should discuss the current design of the API and what the new design will\nneed to include. You will need to discuss the issues with the old design.\nIn your action section, I would like to see discussions which showcase how you have developed the\nnew version API requests. You should outline what needed changing and why. This will help to\nshowcase you have interpreted and implemented a design. You will also need to discuss how\nyou've applied the API to the front end.\nPlease update your report as suggested. If you'd like to discuss the feedback further, please reach\nout to me to set up a support call.\nKeep up the hard work!",
    "S7": "\nI like that you have found a situation in which you had to communicate and work effectively with\ndifferent teams to ensure that you were able to complete your tasks. I like that you outlined the\nissue that you had to face which was to share a specific resource. To develop your submission, you\nshould discuss how you messaged the testers. This should include how you found out which tester\nto message and how you found out when the resource would be available for you to use. I would\nalso recommend include a snippet of the message used to communicate with the different teams.\nPlease note that you should redact names and contact information. I would also include a\nscreenshot of the ticket as this would outline the urgency of your task and the end of the Sprint.",
    "S21": "Unfortunately, I do not believe that this experience showcases how you've used methods,\napproaches and techniques to evaluate software engineering project outcomes. For this criteria,\nyou will need to showcase how you've evaluated the outcomes for a project. You should include\ndata and feedback from stakeholders as part of your demonstration.\nPlease update your submissions as suggested. Reach out to me if you need any additional support.",
    "S4":"I like that you were able to join a new project which involved using DevOp tools. It is great to see that you were able to use BitBucket to store the needed repositories. For this criteria, you have discussed making changes and pushing to remote branches. To develop your discussion, it would be beneficial to include screenshots to showcase how you make the push requests. You should provide more background to the project and discuss what your specific tasks were. This will allow you to discuss the actions you took to develop the code. You should discuss how you debugged the code. It would be beneficial to showcase the tools and actions you took to debug and fix any errors in the code created.",
    "K21":"It great that you were able to pick up a ticket on Jira. To develop your discussion, you should outline what stage of the development lifecycle you operated in. In your discussion, you've outlined what the team did, it would be beneficial to focus on what you did. You should include some screenshots to showcase how you tackled the ticket. Please update your submission as suggested."
}
